{
    "translation": {
        "About": "Sobre",
        "Skills": "Habilidades",
        "Projects": "Projetos",
        "Contact": "Contato",
        "Open main menu": "Abrir menu principal",

        "Hi,": "Oi, ",
        "i am": "eu sou ",
        "Developer": "Developer ",
        "Front": "Front ",
        "End": "End ",
        "I love to explore new things and possibilities 🚀": "Eu adoro explorar novas coisas e possibilidades 🚀",
        "I am a lifelong learner 🎓": "Eu sou um eterno aprendiz 🎓",
        "Disciplined as a military 🎖️": "Disciplinado como um militar 🎖️",
        "And maybe I have a thing for weightlifting 💪": "E talvez eu tenha uma queda por musculação 💪",
        
        "Always Dreaming Big": "Sempre Sonhando Alto ",
        "I always had interest in tech. My first contact with programming was when i was 12 years-old.": "Eu sempre tive interesse em tecnologia. Meu primeiro contato com programação foi aos 12 anos de idade. ",
        "Since then, I have been practicing several knowledge related to technology in general.": "Desde então, eu tenho praticado conhecimento diversos relacionados à tecnologia em geral. ",
        "Lately I discovered the magic and possibilities of web development.": "Recentemente, eu descobri as mágicas e as possibilidades do desenvolvimento web. ",
        "Whenever I can, I always seek new knowledge and skills related to it.": "Sempre que posso, eu procuro por novos conhecimentos e tecnologias relacionados à web. ",
        "See more about my personal life": "Veja mais sobre minha vida pessoal",

        "Personal Project": "Projeto Pessoal",
        "Front-End Project": "Projeto Front-End ",
        "Full Stack Project": "Projeto Full Stack ",
        "Project under development,": "Projeto em desenvolvimento, ",
        "it will be a fullstack application inspired by some famous social networks,": "Será um aplicativo full stack que se inspira em algumas das redes sociais mais usadas no mundo, ",
        "I intend it to have a chat and posts section for users to interact.": "pretendo que ela tenha um chat e seção de posts para os usuários interagirem.. ",
        "An integration with an AI like ChatGPT is a personal goal.": "Uma integração com uma IA como o ChatGPT é um objetivo pessoal. ",
        "In this project,": "Nesse projeto, ",
        "I thought about developing a reddit clone, using their public Json API.": "Eu pensei em desenvolver um clone do Reddit, usando a API JSON oficial. ",
        "I am proud of this work because it was the first one where I planned from beginning to end.": "Eu fiquei orgulhoso desse trabalho, porque ele o primeiro em que eu mesmo planejei do ínicio ao fim. ",
        "Overall, I really liked the end result.": "Portanto, eu gostei bastante do resultado final. ",
        "I thought of making something simple,": "Eu pensei em fazer algo simples, ",
        "intuitive and quick to access weather information,": "intuitivo e rápido para acessar informações sobre o clima, ",
        "similar to a mobile application.": "semelhante a um aplicativo móvel. ",
        "The design was inspired by the google weather widget.": "O design foi inspirado no widget de clima do google. ",
        "See this project online": "Veja este projeto on-line",
        "Co-Authorship Project": "Projeto de participação",
        "This project is not entirely mine,": "Esse projeto não é de minha total autoria, ",
        "it is part of the codecademy curriculum.": "é parte do curriculum da CodeCademy. ",
        "They give us the basis of the page style so that we can implement the application with integration with the spotify API.": "Eles nos dão a base do estilo da página para que implementemos a aplicação com integração com a API do spotify.",

        "Contact Me": "Contato",
        "Call me": "Me ligue",
        "Send me an email": "Me envie um e-mail",
        "Built and designed by": "Construído e desenvolvido por ",
        "Get in touch": "Entre em contato",

        "“If you’re willing to go through all the battling you got to go through": "“Se você está disposto a passar por todas as batalhas pelas quais terá que passar ",
        "to get where you want to get, who’s got the right to stop you?”": "para chegar onde você quer ir, quem tem o direito de te impedir?”",
        "– Rocky Quotes": "– Rocky Balboa citações ",
        "Looking for my": "Procurando pelo meu ",
        "CV": "Currículo",
        "Story section": "Seção História ",
        "I was born in 2003, in São Paulo, Brazil. I had my first real contact with a computer at the age of 6,": "Eu nasci em 2003, em São Paulo, Brasil. Eu tive meu primeiro contato real com um computador quando eu tinha 6 anos, ",
        "I was amazed with all that information, possibilities and dynamism that that evolved machine offered,": "Eu fiquei maravilhado com tanta informação, possibilidades e dinamismo que aquela máquina poderia oferecer, ",
        "all of this in an intel pentium. since then I've always ventured to find out what else could be done with that thing.": "tudo isso em um intel pentium. Desde então, eu tenho sempre me aventurei para descobrir o que mais poderia ser feito com aquela coisa. ",
        "I always had the habit of disassembling the components in order to understanding how they work, even without the necessary knowledge at the time,": "Eu criei o hábito de desmontar os componentes para entender como eles funcionavam, mesmo sem o conhecimento necessário na época, ",
        "I would tinker with the programming to see the changes that would be caused. IT has always been my passion.": "Eu mexia na programação para ver quais mudanças seriam causadas. TI sempre foi minha paixão.",
        "As a person, I believe that my ambition and discipline are my greatest attributes.": "Como indivíduo, eu acredito que minha ambição e disciplina são minhas maiores características.",
        "I'm proud of my values ​​and the education my parents gave me, I intend to reach the top and bring them with me.": "Eu tenho orgulho dos meus valores ​​e e educação que meus pais me deram, tenho a intenção de chegar ao topo, e traze-los comigo.",
        "Some random facts about me:": "Alguns fatos aleatórios sobre mim:",
        ">- My curiosity about new things made me discover some hobbies, such as gym, anime and meditation.": ">- Minha curiosidade me fez descobrir novos hobbies, como musculação, anime and meditação.",
        ">- I am currently responsible for four dogs, two cats and a parrot. a house without animals has no shine.": ">- No momento, sou responsável por quatro cachorros, dois gatos e um papagaio. Não há brilho em uma casa sem animais.",
        ">- I don't like social networks, I value personal contact.": ">- Eu não gosto de redes sociais, eu valorizo o contato pessoal. ",
        ">- I love açai.": ">- Eu adoro açai. ",
        "What i believe as a developer?": "No que eu acredito como desenvolvedor? ",
        "I am a firm believer that clean code,": "Sou um crente convicto do código limpo, ",
        "performance and design standards are the cornerstones of every codebase.": "performance e design patterns são os pilares de toda base de código. ",
        "In a work environment, communication and collaboration between individuals are essential for the good result of a project.": "Em um ambiente de trabalho, comunicação e colaboração entre indivíduos é essencial para o bom resultado de todo projeto. ",
        "I've always been connected to technology, it was love at first sight.": "Sempre estive conectado à tecnologia, foi amor a primeira vista. ",
        "My first contact with programming was at the age of 10, at the time,": "Meu primeiro contato com programação foi quando eu tinha 10 anos de idade, naquela época, ",
        "with Scratch and Python. Code development has always been a hobby for me.": "com Scratch e Python. Desenvolvimento de código sempre esteve presente na minha vida. ",
        "However, since the height of the 2021 pandemic, I have started to take this hobby seriously.": "No entanto, foi somente no auge da pandemia, em 2021, que eu comecei a levar esse hobby a sério. ",
        "I am very proud of the creation of this site. It took a few days of research and attempts.": "Estou muito orgulhoso com criação desse site. Levou alguns dias de pesquisas e muitas tentativas para alcançar esse resultado. ",
        "I would like to give some thanks to:": "Eu gostaria dar agradecimentos especiais para: ",
        "his portfolio page inspired me to create this site.": "Me inspirei na página de portfólio dele para a criação desse site. ",
        "for the design of the astronaut figures, theme of this page.": "pelo design das figuras do astronauta, tema dessa página. "
    }
}